import java.util.Scanner;

public class Main {

    public static void main(String[] args) {

        // НИЖЧЕ ПРИКЛАД КОДУ, ВИКОРИСТОВУЙТЕ ЙОГО ЯК ЗРАЗОК,
        // АЛЕ САМ ПРИКЛАД МОЖНА ВИДАЛИТИ ПОТІМ
        // Приклад сканнера для перехоплення вводу користувача з консолі
        System.out.println("Привіт, відважний герою!");
        System.out.println("Тебе чекає цікава подорож");
        System.out.println("Ти йшов чарівною стежкою, і натрапив на роздоріжжя: 1 - піти наліво, 2 - піти направо");
        Scanner sc = new Scanner(System.in);
        // Таким чином можна отримати цифру яку ввів користувач
        // і зберегти її в змінну типу int
        int choice1 = sc.nextInt();
        if (choice1 == 1) {
            System.out.println("Ти обрав піти наліво");
            // відняти очки здоров*я
        } else if (choice1 == 2) {
            System.out.println("Ти обрав піти направо");
            // додати очки удачі
        } else {
            System.out.println("Ти заплутався");
            // відняти очки здоров*я
        }
        // КІНЕЦЬ ПРИКЛАДУ, ВИДАЛІТЬ ПРИКЛАД, ЩОБ В КОДІ БУЛО ТІЛЬКИ ВАШЕ РІШЕННЯ



        // Нижче пишіть ваш код з реалізацією завдання
        // Коли пишете логіку гри - не забувайте періодично запускати програму
        // І переконуватись, що все працює як треба, заодно тестуйте її перебираючи інпути

    }

}
